#https://www.zenkyozu.co.jp/wp-content/uploads/2011/06/45a75d571dc57e97f31e356d5fec9590.pdf
seikai = 0
dc = {"北海道": "札幌", "青森県": "青森", "岩手県": "盛岡", "宮城県": "仙台", "秋田県": "秋田", "山形県": "山形", "福島県": "福島", "茨城県": "水戸", "栃木": "宇都宮", "群馬県": "前橋", "埼玉県": "さいたま", "千葉県": "千葉", "東京都": "東京", "神奈川県": "横浜", "新潟県": "新潟", "富山県": "富山", "石川県": "金沢", "福井県": "福井", "山梨県": "甲府", "長野県": "長野", "岐阜県": "岐阜", "静岡県": "静岡", "愛知県": "名古屋", "三重県": "津", "滋賀": "大津", "京都府": "京都", "大阪府": "大阪", "兵庫県": "神戸", "奈良県": "奈良", "和歌山県": "和歌山", "鳥取県": "鳥取", "島根県": "松江", "岡山県": "岡山", "広島県": "広島", "山口県": "山口", "徳島県": "徳島", "香川県": "高松", "愛媛": "松山", "高知県": "高知", "福岡県": "福岡", "佐賀県": "佐賀", "長崎県": "長崎", "熊本県": "熊本", "大分県": "大分", "宮崎県": "宮崎", "鹿児島県": "鹿児島", "沖縄県": "那覇",}
while True:
    if len(dc) == 0:
        print("問題がなくなったので終了します正解率100%")
        exit()
    import random
    ran = random.randint(0, len(dc) - 1)
    #print(ran, len(dc))
    todou = list(dc.items())[ran]
    #print(todou)

    print(f"{todou[0]}の県庁所在地はどこですか(終わりたかったらexitと打ってください)")
    kai = input()
    if kai == todou[1]:
        print("正解！")
        del dc[todou[0]]
        seikai += 1
        print(seikai)
    elif kai == "exit":
        seikai = (seikai / 47) * 100
        seikairitu = ('{:.3f}'.format(seikai))
        print(f"正解率は{seikairitu}%でした")
        exit()

    else:
        print("不正解...")
        print(f"正解は{todou}でした")
